Пансион83/src/DataProcessors/НачислениеУслуг/НачислениеУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НачислениеУслуг</name>
  <attributes>
    <name>Room</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ServicePackage</name>
    <type>
      <types>CatalogRef.ПакетыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.Размещение</types>
      <types>DocumentRef.Бронирование</types>
    </type>
  </attributes>
  <attributes>
    <name>GuestGroup</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MarketingCode</name>
    <type>
      <types>CatalogRef.КодМаркетинга</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceOfBusiness</name>
    <type>
      <types>CatalogRef.ИсточИнфоГостиница</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Charges</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Room</name>
      <type>
        <types>CatalogRef.НомернойФонд</types>
      </type>
    </attributes>
    <attributes>
      <name>Client</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Service</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Размещение</types>
        <types>DocumentRef.Бронирование</types>
      </type>
    </attributes>
    <attributes>
      <name>Error</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Folio</name>
      <type>
        <types>DocumentRef.СчетПроживания</types>
      </type>
    </attributes>
    <attributes>
      <name>IsChanging</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Пансион83/src/Documents/Платеж/Платеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Платеж</name>
  <basedOn>Document.СчетПроживания</basedOn>
  <basedOn>Document.ПреАвторизация</basedOn>
  <registerRecords>AccumulationRegister.ПлатежиУслуги</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаПоСменам</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.НакопитСкидки</registerRecords>
  <registerRecords>AccumulationRegister.Платежи</registerRecords>
  <registerRecords>AccumulationRegister.НаличныеКасса</registerRecords>
  <registerRecords>AccumulationRegister.ПодарочСертификат</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКонтрагенты</registerRecords>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>ParentDoc</name>
    <type>
      <types>DocumentRef.Размещение</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.БроньУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>DocumentRef.СчетПроживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>Payer</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingCustomer</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountingContract</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>GuestGroup</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentSection</name>
    <type>
      <types>CatalogRef.ОтделОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.СтавкаНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>VATSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SumInFolioCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATSumInFolioCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRateDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentCurrencyExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolioCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>FolioCurrencyExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreditCard</name>
    <type>
      <types>CatalogRef.КредитныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AuthorizationCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TerminalNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SlipText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AnnulationSlipText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfAnnulation</name>
    <type>
      <types>EnumRef.CancelActionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorOfAnnulation</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfAnnulation</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Preauthorisation</name>
    <type>
      <types>DocumentRef.ПреАвторизация</types>
    </type>
  </attributes>
  <attributes>
    <name>CardType</name>
    <type>
      <types>CatalogRef.ТипыКредитныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GiftCertificate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CardOperationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderNumber</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentSections</name>
    <attributes>
      <name>PaymentSection</name>
      <type>
        <types>CatalogRef.ОтделОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>VATSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SumInFolioCurrency</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATSumInFolioCurrency</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Пансион83/src/DataProcessors/НачислениеУслуг/Forms/NotificationForm/Module.bsl
//--------------------------------------------------------------------------
&НаКлиенте
Процедура OnOpen(pCancel)
	OnOpenAtServer();
КонецПроцедуры //OnOpen

//--------------------------------------------------------------------------
&AtServer
Процедура OnOpenAtServer()
	vChargesFailCount = 0;
	vChargesSuccessCount = 0;
	vIsNotOneFolio = False;
	ErrorsString = NStr("en='НЕ posted transactions:';ru='Непроведенные транзакции: ';de='Nicht durchgeführte Transaktionen: '")+Chars.LF;
	Sum = 0;
	For Each vRow In Object.НачислениеУслуг Do
		If vRow.Error Тогда
			vChargesFailCount = vChargesFailCount + 1;
			If ЗначениеЗаполнено(vRow.СчетПроживания) Тогда
				ErrorsString = ErrorsString + String(vChargesFailCount)+". "+Format(vRow.ДатаДок, "DF='dd.MM.yyyy'")+" "+
				?(ЗначениеЗаполнено(vRow.Клиент), TrimAll(vRow.Клиент), "")+
				?(ЗначениеЗаполнено(vRow.НомерРазмещения),NStr("en=' ГруппаНомеров: ';ru=' Номер: ';de=' Zimmer: '")+TrimAll(vRow.НомерРазмещения), "")+
				NStr("en=' ЛицевойСчет: ';ru=' Фолио: ';de=' ЛицевойСчет: '")+TrimAll(vRow.СчетПроживания.НомерДока)+" ("+TrimAll(vRow.Услуга)+")"+Chars.LF;
			Else
				ErrorsString = ErrorsString + String(vChargesFailCount)+". "+Format(vRow.ДатаДок, "DF='dd.MM.yyyy'")+" "+
				?(ЗначениеЗаполнено(vRow.Клиент), TrimAll(vRow.Клиент), "")+
				?(ЗначениеЗаполнено(vRow.НомерРазмещения),NStr("en=' ГруппаНомеров: ';ru=' Номер: ';de=' Zimmer: '")+TrimAll(vRow.НомерРазмещения), "")+" ("+TrimAll(vRow.Услуга)+")"+Chars.LF;
			EndIf;
		Else
			vChargesSuccessCount = vChargesSuccessCount + 1;
			If ЗначениеЗаполнено(vRow.СчетПроживания) Тогда
				If vRow.СчетПроживания <> Object.НачислениеУслуг.Get(0).СчетПроживания Тогда
					vIsNotOneFolio = True;
				EndIf;
			EndIf;
			Sum = Sum + vRow.Сумма;
		EndIf;
	EndDo;	
	Items.MainMessage.Title = "Успешно начислено "+vChargesSuccessCount+"/"+String(vChargesFailCount+vChargesSuccessCount)+" транзакций на сумму: "+Format(Sum, "ND=17; NFD=2; NZ=");
	If vChargesFailCount > 0 Тогда
		Items.AdditionalErrorsTabulation.Visible = False;
		Items.OpenErrorList.Visible = True;
	Else
		If НЕ vIsNotOneFolio Тогда
			Items.AdditionalPaymentTabulation.Visible = False;
			Items.DoPayment.Visible = True;
		EndIf;
	EndIf;
КонецПроцедуры //OnOpenAtServer

//--------------------------------------------------------------------------
&НаКлиенте
Процедура CloseButton(pCommand)
	ЭтаФорма.Close();
	If НЕ ЭтаФорма.FormOwner.Window.IsMain Тогда
		ЭтаФорма.FormOwner.Close();
	EndIf;
КонецПроцедуры //Close

//--------------------------------------------------------------------------
&НаКлиенте
Процедура DoPayment(pCommand)
	// Create new payment
	УпрСерверныеФункции.cmWriteLogEventAtServer(NStr("en='Document.Create';ru='Документ.СозданиеНового';de='Document.Create'"),, "Documents.Платеж", "Documents.Платеж.EmptyRef()", NStr("en='Create new';ru='Создание нового';de='Erstellung eines neuen'"));
	OpenForm("Document.Платеж.Form.tcDocumentForm", New Structure("Document, Сумма", Object.НачислениеУслуг.Get(0).СчетПроживания, Sum, ЭтаФорма),,,,, Новый ОписаниеОповещения("DoPaymentЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура DoPaymentЗавершение(Result, ДополнительныеПараметры) Экспорт
	
	CloseButton(Неопределено);

КонецПроцедуры //DoPayment

//--------------------------------------------------------------------------
&НаКлиенте
Процедура OpenErrorList(pCommand)
	Items.ErrorsString.Visible = НЕ Items.ErrorsString.Visible;
КонецПроцедуры //OpenErrorList
